
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// HUD、ヘッダーファイル [hud.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.2D.h"

//****************************************************
// HUDクラスの定義
//****************************************************
class CHud : public CRect2D
{
	//****************************************************
	// 前方宣言
	//****************************************************
	class Impl;

public:

	//****************************************************
	// special function
	//****************************************************
	CHud(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CHud() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 目標トランスフォームの操作用
	const OBJ::Transform& GetTransformTarget() const;
	      void            SetTransformTarget(const OBJ::Transform& TF);

	// 目標色の操作用
	const DirectX::XMFLOAT4& GetColTarget() const;
	      void               SetColTarget(const DirectX::XMFLOAT4& Col);

private:

	//****************************************************
	// function
	//****************************************************
	void CorrectTransformToTarget(); // 目標値への補間

	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<Impl> m_upImpl;
};