
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// 全画面ポリゴン(2D)、ヘッダーファイル [fullscreen.2D.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.object.h"

//****************************************************
// 全画面ポリゴン(2D)クラスの定義
//****************************************************
class CFullScreen2D : public CObject
{
	//****************************************************
	// 前方宣言
	//****************************************************
	class Impl;

public:

	//****************************************************
	// special function
	//****************************************************
	CFullScreen2D(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CFullScreen2D();                                // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 頂点シェーダーのバインド
	void SetVertexShader(const ComPtr<ID3D11VertexShader>& rcpVS);

	// ピクセルシェーダーのバインド
	void SetPixelShader(const ComPtr<ID3D11PixelShader>& rcpPS);

	// 定数バッファのバインド
	void SetConstantBuffer(const ComPtr<ID3D11Buffer>& rcpCB);

private:

	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<Impl> m_upImpl;
};