
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// 物理ワールド、ヘッダーファイル [world.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.singleton.h"
#include "btBulletDynamicsCommon.h"

//****************************************************
// 物理ワールドクラスの定義
//****************************************************
class CWorld final : public CSingleton<CWorld>
{
	//****************************************************
	// 前方宣言
	//****************************************************
	class CWorldImpl;

	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CWorld>;
	friend CWorld& CSingleton<CWorld>::RefInstance();

public:

	//****************************************************
	// 剛体情報の構造体
	//****************************************************
	struct RigidBody
	{
		std::unique_ptr<btCollisionShape>     upCollisionShape;
		std::unique_ptr<btDefaultMotionState> upMotionState;
		std::unique_ptr<btRigidBody>          upRigidBody;
	};

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	// 更新処理
	void Update();

	// ワールドのユニークポインタを参照
	const std::unique_ptr<btDiscreteDynamicsWorld>& RefDynamicsWorldConst() const;

	// ワールドにリジッドボディを追加
	void AddRigidBody(const std::unique_ptr<btRigidBody>& upRB);

private:

	//****************************************************
	// special function
	//****************************************************
	CWorld();           // デフォルトコンストラクタ
	~CWorld() override; // デストラクタ

	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<CWorldImpl> m_upImpl;
};