
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// ピクセルシェーダーマネージャー、ヘッダーファイル [pixelshader.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.manager.h"

//****************************************************
// ピクセルシェーダーマネージャークラスの定義
//****************************************************
class CPixelShaderManager : public CManager<CPixelShaderManager, ComPtr<ID3D11PixelShader>>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CPixelShaderManager>;
	friend CPixelShaderManager& CSingleton<CPixelShaderManager>::RefInstance();

	//****************************************************
	// 静的メンバ変数の定義
	//****************************************************
	static constexpr const char* INITIALIZE_PATH = "Data\\JSON\\PS.List.json";

private:

	//****************************************************
	// special function
	//****************************************************
	CPixelShaderManager() = default; // デフォルトコンストラクタ
	~CPixelShaderManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize() override; // 初期化処理
	void Finalize()   override; // 終了処理
};