
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// シングルトンクラステンプレート、ヘッダーファイル [singleton.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

#if 0
//****************************************************
// コンセプトの定義
//****************************************************
template <typename T>
concept AutoInitializableAndFinalizable = requires(T t)
{
	{ t.Initialize() } -> std::same_as<bool>;
}
&& requires(T t)
{
	{ t.Finalize() } -> std::same_as<void>;
};
#endif

//****************************************************
// シングルトンクラステンプレートの定義
//****************************************************
template <typename T>
class CSingleton
{
public:

	//****************************************************
	// operator
	//****************************************************
	CSingleton& operator=(const CSingleton&) = delete; // コピー代入演算子を削除
	CSingleton& operator=(CSingleton&&)      = delete; // ムーブ代入演算子を削除

	//****************************************************
	// special function
	//****************************************************
	CSingleton(const CSingleton&) = delete; // コピーコンストラクタを削除
	CSingleton(CSingleton&&)      = delete; // ムーブコンストラクタを削除

	//****************************************************
	// static function
	//****************************************************

	// インスタンスの参照を取得します
	static T& RefInstance();

protected:

	//****************************************************
	// special function
	//****************************************************
	        CSingleton()  = default; // デフォルトコンストラクタ
	virtual ~CSingleton() = default; // デストラクタ

private:

	//****************************************************
	// data
	//****************************************************

	// インスタンスのファクトリ
	static std::function<std::unique_ptr<T>()> s_fpFactory;

	// インスタンスのポインタ
	static std::unique_ptr<T> s_upInstance;
};

// テンプレート実装ファイル
#include "API.singleton.tpp"