//============================================================================
// 
// テクスチャマネージャー、ヘッダーファイル [texture.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.manager.h"
#include <WICTextureLoader.h>

//****************************************************
// テクスチャマネージャークラスの定義
//****************************************************
class CTextureManager : public CManager<CTextureManager, ComPtr<ID3D11ShaderResourceView>>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CTextureManager>;
	friend CTextureManager& CSingleton<CTextureManager>::RefInstance();

	//****************************************************
	// 静的メンバ変数の定義
	//****************************************************
	static constexpr const char* INITIALIZE_PATH = "Data\\JSON\\Texture.List.json";

private:

	//****************************************************
	// special function
	//****************************************************
	CTextureManager();           // デフォルトコンストラクタ
	~CTextureManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize() override; // 初期化処理
	void Finalize()   override; // 終了処理
};