
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// glTFモデル、ヘッダーファイル [model.gltf.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.object.h"

//****************************************************
// 前方宣言
//****************************************************
struct GltfMesh;

//****************************************************
// glTFモデルクラスの定義
//****************************************************
class CGltf
{
	//****************************************************
	// 前方宣言
	//****************************************************
	class Impl;

public:

	//****************************************************
	// special function
	//****************************************************

	// デフォルトコンストラクタ
	CGltf();

	// デストラクタ
	~CGltf();

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update(const OBJ::Transform& TF);

	// 描画処理
	void Draw();

	// モデルのバインド
	void SetModel(GltfMesh* pData);

	// 頂点シェーダーのバインド
	void SetVertexShader(const ComPtr<ID3D11VertexShader>& rcpVS);

	// 入力レイアウトのバインド
	void SetInputLayout(const ComPtr<ID3D11InputLayout>& rcpIL);

	// ピクセルシェーダーのバインド
	void SetPixelShader(const ComPtr<ID3D11PixelShader>& rcpPS);

private:

	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<Impl> m_upImpl;
};