
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// glTFモデルマネージャー、ヘッダーファイル [gltf.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.manager.h"
#include <tiny_gltf.h>

//****************************************************
// glTFモデルマネージャークラスの定義
//****************************************************
class CGltfManager : public CManager<CGltfManager, tinygltf::Model>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CGltfManager>;
	friend CGltfManager& CSingleton<CGltfManager>::RefInstance();

	//****************************************************
	// 静的メンバ変数の定義
	//****************************************************
	static constexpr const char* INITIALIZE_PATH = "Data\\JSON\\glTF.List.json";

private:

	//****************************************************
	// special function
	//****************************************************
	CGltfManager() = default; // デフォルトコンストラクタ
	~CGltfManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize() override; // 初期化処理
	void Finalize()   override; // 終了処理
	
	//****************************************************
	// data
	//****************************************************
	tinygltf::TinyGLTF m_Loader; // glTFのローダーオブジェクト
};