
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// glTFモデルマネージャー、ヘッダーファイル [gltf.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.manager.h"
#include <tiny_gltf.h>
#include <WICTextureLoader.h>

//****************************************************
// メッシュ情報の構造体を定義
//****************************************************
struct GltfMesh
{
	tinygltf::Model                  Model;        // glTFモデル
	ComPtr<ID3D11Buffer>             cpVertexBuff; // 頂点バッファ
	ComPtr<ID3D11Buffer>             cpIndexBuff;  // インデックスバッファ
	int                              nNumIndex;    // インデックス数
	ComPtr<ID3D11ShaderResourceView> cpTexture;    // テクスチャ
};

//****************************************************
// glTFモデルマネージャークラスの定義
//****************************************************
class CGltfManager : public CManager<CGltfManager, GltfMesh>
{
	//****************************************************
	// 前方宣言
	//****************************************************
	class Impl;

	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CGltfManager>;
	friend CGltfManager& CSingleton<CGltfManager>::RefInstance();

private:

	//****************************************************
	// special function
	//****************************************************
	CGltfManager();           // デフォルトコンストラクタ
	~CGltfManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize() override; // 初期化処理
	void Finalize()   override; // 終了処理
	
	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<Impl> m_upImpl;
};