
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// 頂点シェーダーマネージャー、ヘッダーファイル [vertexshader.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.manager.h"

//****************************************************
// 頂点シェーダーマネージャークラスの定義
//****************************************************
class CVertexShaderManager : public CManager<CVertexShaderManager, ComPtr<ID3D11VertexShader>>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CVertexShaderManager>;
	friend CVertexShaderManager& CSingleton<CVertexShaderManager>::RefInstance();

	//****************************************************
	// 静的メンバ変数の定義
	//****************************************************
	static constexpr const char* INITIALIZE_PATH = "Data\\JSON\\VS.List.json";

private:

	//****************************************************
	// special function
	//****************************************************
	CVertexShaderManager() = default; // デフォルトコンストラクタ
	~CVertexShaderManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize() override; // 初期化処理
	void Finalize()   override; // 終了処理
};