//============================================================================
// 
// アーチ、ヘッダーファイル [arch.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// 前方宣言
//****************************************************
class CBoomerang;

//****************************************************
// 進路クラスの定義
//****************************************************
class CArch : public CRect3D
{
	//****************************************************
	// 静的メンバ定数の定義
	//****************************************************
	static constexpr float FACTOR_BRIFHT  = 0.05f; // 明度変化量
	static constexpr float MARGIN_TEXTURE = 5.0f;  // テクスチャマージン

public:

	//****************************************************
	// special function
	//****************************************************
	CArch(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CArch() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 追従対象の物理モデルとその進行方向を設定
	void SetTrackTarget(const std::shared_ptr<CBoomerang>& spTarget);

private:

	//****************************************************
	// function
	//****************************************************
	void UpdateBright(); // 明度の更新

	//****************************************************
	// data
	//****************************************************
	std::weak_ptr<CBoomerang> m_wpTrackTarget; // 追従対象のブーメラン
	float                     m_fBright;       // 明度
	float                     m_fBrightFactor; // 明度変化量
};