//============================================================================
// 
// ビームライト、ヘッダーファイル [beamlight.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.fullscreen.2D.h"

//****************************************************
// ビームライトクラスの定義
//****************************************************
class CBeamLight : public CFullScreen2D
{
	//****************************************************
	// 独自の位置と時間の定数バッファ
	//****************************************************
	struct alignas(16) CB_BeamLight
	{
		DirectX::XMFLOAT2 Pos;  // 位置
		float             Time; // 時間
		float             Padding;
	};

public:

	//****************************************************
	// special function
	//****************************************************
	CBeamLight(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CBeamLight();                                // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	//****************************************************
	// inline function
	//****************************************************

	// 位置の設定
	inline void SetPos(const DirectX::XMFLOAT2& Pos) { m_Pos = Pos; }

	// 時間の設定
	inline void SetTime(float fTime) { m_fTime = fTime; }

	// 時間の有効化状態の設定
	inline void SetEnableTime(bool bState = true) { m_bEnableTime = bState; }

private:

	//****************************************************
	// function
	//****************************************************
	void UpdateConstantBuffer(); // 定数バッファの更新

	//****************************************************
	// data
	//****************************************************
	ComPtr<ID3D11Buffer> m_cpConstantBuffer; // 定数バッファ
	DirectX::XMFLOAT2    m_Pos;              // 位置
	float                m_fTime;            // 時間
	bool                 m_bEnableTime;      // 時間の有効化状態
};