//============================================================================
// 
// カメラの移動制御 [cameracontroller.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "cameracontroller.h"
#include "API.renderer.h"
#include "API.camera.h"

using namespace useful;
//============================================================================
// デフォルトコンストラクタ
//============================================================================
CCameraController::CCameraController()
	: m_Camera(nullptr)
{
	// カメラの情報取得
	m_Camera = CRenderer::RefInstance().GetCamera();
}

//============================================================================
// デストラクタ
//============================================================================
CCameraController::~CCameraController()
{
	m_Players.clear();
	m_Camera = nullptr;
}

//============================================================================
// 初期設定
//============================================================================
bool CCameraController::Initialize()
{
	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CCameraController::Finalize()
{

}

//============================================================================
// 更新処理
//============================================================================
void CCameraController::Update()
{
	CameraMove();
}

//============================================================================
// プレイヤーの登録
//============================================================================
void CCameraController::Regist(CPlayer* player)
{
	m_Players.push_back(player);
}

//============================================================================
// プレイヤーの削除
//============================================================================
void CCameraController::UnRegist(CPlayer* player)
{
	for (auto ite = m_Players.begin(); ite != m_Players.end(); ite++)
	{
		if (*ite == player)
		{// 同じとき

			// 削除
			ite = m_Players.erase(ite);
			break;
		}
	}
}

//============================================================================
// デバッグカメラ移動
//============================================================================
void CCameraController::CameraMove()
{
	// ターゲットの位置設定
	DirectX::XMVECTOR TargetPos = { 20.0f,0.0f ,0.0f };

	//ExponentialDecay(Pos, TargetPos, 0.25f);
	//m_Camera->SetPos(Pos);
}