//============================================================================
// 
// カメラの移動制御 [cameracontroller.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "cameracontroller.h"
#include "API.renderer.h"
#include "API.camera.h"
#include "player.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CCameraController::CCameraController()
	: m_Camera(nullptr)
	, m_PlayersCenterPos({0.0f,0.0f,0.0f})
{
	
}

//============================================================================
// デストラクタ
//============================================================================
CCameraController::~CCameraController()
{
	
}

//============================================================================
// 初期設定
//============================================================================
bool CCameraController::Initialize()
{
	//using namespace useful;

	// 初期化
	m_Players.clear();

	// カメラの情報取得
	m_Camera = nullptr;
	m_Camera = CRenderer::RefInstance().GetCamera();

	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CCameraController::Finalize()
{}

//============================================================================
// 更新処理
//============================================================================
void CCameraController::Update()
{
	// カメラ移動
	CameraMove();
}

//============================================================================
// プレイヤーの登録
//============================================================================
void CCameraController::Regist(CPlayer* player)
{
	m_Players.push_back(player);
}

//============================================================================
// プレイヤーの削除
//============================================================================
void CCameraController::UnRegist(CPlayer* player)
{
	for (auto ite = m_Players.begin(); ite != m_Players.end(); ite++)
	{
		if (*ite == player)
		{// 同じとき

			// 削除
			ite = m_Players.erase(ite);
			break;
		}
	}
}

//============================================================================
// カメラ移動
//============================================================================
void CCameraController::CameraMove()
{
	// カメラの注視点位置設定
	CalculatePlayersCenter();
	m_Camera->SetPosTarget(m_PlayersCenterPos);
}

//============================================================================
// プレイヤーの中心位置を計算
//============================================================================
void CCameraController::CalculatePlayersCenter()
{
	using namespace useful;

	DirectX::XMFLOAT3 PlayersPos = { 0.0f,0.0f, 0.0f };
	for (auto ite : m_Players)
	{
		// プレイヤーの位置取得
		PlayersPos += ite->GetTransform().Pos;
	}

	// プレイヤーの位置を全て足したものを人数で割って平均の位置を計算
	PlayersPos = PlayersPos / static_cast<float>(m_Players.size());

	// 高さ変えない
	PlayersPos.y = m_Camera->GetPos().y;

	// 中心位置に設定
	m_PlayersCenterPos = PlayersPos;
}