//============================================================================
// 
// 塵 [dust.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.physics.object.h"

//****************************************************
// 塵クラスの定義
//****************************************************
class CDust : public CPhysicsObject
{
public:

	//****************************************************
	// special function
	//****************************************************
	CDust(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CDust() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	//****************************************************
	// static function
	//****************************************************
	static void GenerateSpread(const DirectX::XMFLOAT3& Pos, int nNum);                     // 拡散発生
	static void GenerateLinear(const DirectX::XMFLOAT3& Pos, const DirectX::XMFLOAT3& Dir); // 直線発生

private:

	//****************************************************
	// function
	//****************************************************
	void FactoryCollider(); // コライダーのファクトリ
};