//============================================================================
// 
// フィールド、ヘッダーファイル [filed.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.physics.object.h"

//****************************************************
// フィールドクラスの定義
//****************************************************
class CField : public CPhysicsObject
{
public:

	//****************************************************
	// special function
	//****************************************************
	CField(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CField() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// コライダーのファクトリ
	void FactoryCollider(float fWidth = 1.0f, float fHeight = 1.0f, float fDepth = 1.0f) override;

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;
};