//============================================================================
// 
// フィールド [field.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "field.h"
#include "API.rigidbody.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CField::CField(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CPhysicsObject(Type, Layer)
{}

//============================================================================
// デストラクタ
//============================================================================
CField::~CField()
{}

//============================================================================
// コライダーのファクトリ
//============================================================================
void CField::FactoryCollider(float fWidth, float fHeight, float fDepth)
{
	// フィールド用のリジッドボディの生成
	SetCollider(CRigidBody::CreateRigidBody(GetTransform(), Collision::SHAPETYPE::BOX, fWidth, fHeight, fDepth));

	// コライダーをリジッドボディにキャスト
	CRigidBody* pRB = useful::DownCast<CRigidBody>(GetCollider());

	// スタティックに変更
	pRB->SetMass(0.0f);

	// 地面の反発係数を設定
	pRB->SetRestitution(1.0f);
}

//============================================================================
// 更新処理
//============================================================================
void CField::Update()
{
	// 物理オブジェクト用の更新
	CPhysicsObject::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CField::Draw()
{
	// 物理オブジェクト用の更新
	CPhysicsObject::Draw();
}