//============================================================================
// 
// ギミックマネージャー、ヘッダーファイル [gimmick.manager.h]
// Author : 後藤優輝
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.singleton.h"

//****************************************************
// ギミックマネージャークラスの定義
//****************************************************
class CGimmickManager final : public CSingleton<CGimmickManager>
{

	//****************************************************
	// 出現条件を表す構造体
	//****************************************************
	struct SpawnCondition
	{
		//float triggerTime;               // 経過時間で出現
		std::function<bool()> condition; // 出現条件
		//DirectX::XMFLOAT3 spawnPosition; // 出現位置
		//std::string objectType;			 // 何を出すか
		int quantity;                    // 数量
	};

	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CGimmickManager>;
	friend CGimmickManager& CSingleton<CGimmickManager>::RefInstance();

public:

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update();

private:

	//****************************************************
	// special function
	//****************************************************
	CGimmickManager();           // デフォルトコンストラクタ
	~CGimmickManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	// 生成
	void Create(int Num);

	// ギミックを出現させるか判定
	void CanSpawnGimmick();

	//****************************************************
	// data
	//****************************************************

	std::vector<SpawnCondition> m_SpawnConditions;
	int m_SpawnTime;
};