//============================================================================
// 
// ギミックマネージャー [gimmick.manager.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "gimmick.manager.h"
#include "IronBall.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CGimmickManager::CGimmickManager():
	m_SpawnTime(0)
{}

//============================================================================
// デストラクタ
//============================================================================
CGimmickManager::~CGimmickManager()
{}

//============================================================================
// 初期化処理
//============================================================================
bool CGimmickManager::Initialize()
{
	//ギミック発生条件の設定
	SpawnCondition Condition;

	//生成条件
	Condition.condition = [this]() -> bool
	{
		return m_SpawnTime > 120;
	};

	//生成数
	Condition.quantity = 1;

	//保存
	m_SpawnConditions.push_back(Condition);

	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CGimmickManager::Finalize()
{

}

//============================================================================
// 更新処理
//============================================================================
void CGimmickManager::Update()
{
	m_SpawnTime++;

	// ギミックを出現させるか判定
	CanSpawnGimmick();
}

//============================================================================
// 生成処理
//============================================================================
void  CGimmickManager::Create(int Num)
{
	for (int i = 0; i < Num; i++)
	{
		//鉄球の生成
		CObject::Create<CIronBall>(OBJ::TYPE::NONE, OBJ::LAYER::DEFAULT, CIronBall::s_fpDefaultFactory);
	}
}

//============================================================================
// ギミックを出現させるか判定
//============================================================================
void CGimmickManager::CanSpawnGimmick()
{
	for (auto it = m_SpawnConditions.begin(); it != m_SpawnConditions.end();)
	{
		if (it->condition())
		{
			Create(it->quantity);

			it = m_SpawnConditions.erase(it);
		}
		else
		{
			it++;
		}
	}
}