//============================================================================
// 
// 鉄球 [IronBall.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "IronBall.h"

#include "state.h"
#include "API.object.manager.h"
#include "API.world.h"
#include "API.gltf.manager.h"
#include "field.h"
//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//****************************************************
// 静的メンバ変数の定義 (公開)
//****************************************************

// デフォルトのファクトリ
std::function<bool(CIronBall*)> CIronBall::s_fpDefaultFactory =
[](CIronBall* pIronBall) -> bool
{
	// 初期化処理
	pIronBall->Initialize();

	// モデルの取得
	auto pModel = CGltfManager::RefInstance().RefRegistry().BindAtKey("Penis");

	// モデルの設定
	pIronBall->SetModel(pModel);

	return true;
};

//============================================================================
// コンストラクタ
//============================================================================
CIronBall::CIronBall(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CGltf(Type, Layer)
{}

//============================================================================
// デストラクタ
//============================================================================
CIronBall::~CIronBall()
{}

//============================================================================
// 初期化処理
//============================================================================
bool CIronBall::Initialize()
{
	//// オブジェクト(Xモデル)の初期化処理
	//if (FAILED(CGltf::Initialize()))
	//{
	//	return false;
	//}

	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CIronBall::Finalize()
{
	// オブジェクト(Xモデル)の終了処理
	//CGltf::Finalize();
}

//============================================================================
// 更新処理
//============================================================================
void CIronBall::Update()
{
	//移動処理
	//Move();

	// オブジェクト(Xモデル)の更新処理
	// 行列の再計算を含んでいるため更新処理の終わりに呼びます
	CGltf::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CIronBall::Draw()
{
	// オブジェクト(Xモデル)の描画処理
	CGltf::Draw();
}

//============================================================================
//移動処理
//============================================================================
void CIronBall::Move()
{
	// 移動速度スケール
	const float fSpeed = 5.0f;
	btVector3   rMoveDir = { 0.0f, 0.0f, 0.0f };

	// 加速度：XZ軸：方向に沿って単位ベクトルに速度係数を掛けたものを設定
	rMoveDir.setX(sinf(0.0f) * fSpeed);
	rMoveDir.setZ(cosf(0.0f) * fSpeed);

	// 加速度：Y軸：現在の重力速度を維持
	btVector3 rCurrentVel = RefRgidBody().upRigidBody->getLinearVelocity();
	rMoveDir.setY(rCurrentVel.getY());
	RefRgidBody().upRigidBody->setLinearVelocity(rMoveDir);
}