//============================================================================
// 
// 鉄球、ヘッダーファイル [IronBall.h]
// Author : 後藤優輝
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.model.gltf.h"


//****************************************************
// 鉄球クラスの定義
//****************************************************
class CIronBall : public CGltf
{
public:

	//****************************************************
	// 静的メンバ変数の宣言 (公開)
	//****************************************************
	static float COEF_MOVE_SPEED; //移動値

	// デフォルトのファクトリ
	static std::function<bool(CIronBall*)> s_fpDefaultFactory;

	//****************************************************
	// special function
	//****************************************************
	CIronBall(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CIronBall() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

private:

	//****************************************************
	// function
	//****************************************************
	
	//移動処理
	void Move();
};