//============================================================================
// 
// 障害物、ヘッダーファイル [obstacle.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.physics.object.h"

//****************************************************
// 障害物クラスの定義
//****************************************************
class CObstacle : public CPhysicsObject
{
public:

	//****************************************************
	// special function
	//****************************************************
	CObstacle(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CObstacle() override = 0;                   // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// コライダーのファクトリ
	void FactoryCollider(float fWidth = 1.0f, float fHeight = 1.0f, float fDepth = 1.0f) override;

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// パラメータの編集
	virtual void EditParam() = 0;
};