//============================================================================
// 
// オイル [Oil.h]
// Author : 元地弘汰
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "obstacle.h"
#include "API.rigidbody.h"


//****************************************************
// オイルクラスの定義
//****************************************************
class COil : public CObstacle
{
public:

	//****************************************************
	// special function
	//****************************************************
	COil(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~COil() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// コライダーのファクトリ
	void FactoryCollider(float fWidth = 1.0f, float fHeight = 1.0f, float fDepth = 1.0f) override;

	// 更新処理
	void Update() override;

	
	// 描画処理
	void Draw() override;

	// パラメータの編集
	void EditParam() override { int i = 0; }

private:

	//****************************************************
	// function
	//****************************************************
	
	//挙動
	void Action();

	//プレイヤーとの接触
	void ToPlayer();

	//****************************************************
	// data
	//****************************************************
	int m_nTimer;
};
