//============================================================================
// 
// 進路、ヘッダーファイル [route.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// 前方宣言
//****************************************************
class CObstacle;

//****************************************************
// 進路クラスの定義
//****************************************************
class CRoute : public CRect3D
{
	//****************************************************
	// 静的メンバ定数の定義
	//****************************************************
	static constexpr float FACTOR_BRIFHT = 0.02f; // 明度変化量

public:

	//****************************************************
	// special function
	//****************************************************
	CRoute(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CRoute() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 追従対象の物理モデルとその進行方向を設定
	void SetTrackTarget(const std::shared_ptr<CObstacle>& spTarget);

private:

	//****************************************************
	// function
	//****************************************************
	void UpdateBright(); // 明度の更新

	//****************************************************
	// data
	//****************************************************
	std::weak_ptr<CObstacle> m_wpTrackTarget; // 追従対象の障害物
	int                      m_nDirection;    // 方向
	float                    m_fBright;       // 明度
	float                    m_fBrightFactor; // 明度変化量
};