//============================================================================
// 
// デバッグルーム [scene.debugroom.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "scene.debugroom.h"

// 遷移先のシーン
#include "API.scene.manager.h"
#include "scene.title.h"

// インプット取得のため
#include "API.input.manager.h"

// オブジェクト生成・破棄のため
#include "API.renderer.h"
#include "API.object.manager.h"
#include "API.model.gltf.h"
#include "API.physics.object.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CSceneDebugRoom::CSceneDebugRoom()
{}

//============================================================================
// デストラクタ
//============================================================================
CSceneDebugRoom::~CSceneDebugRoom()
{}

//============================================================================
// 更新処理
//============================================================================
void CSceneDebugRoom::Update()
{
	// シーン遷移がない代わりに全てのオブジェクトを破棄
	if (CInputManager::RefInstance().EnhancedEnter())
	{
		Change();
	}
}

//============================================================================
// シーン変更
//============================================================================
void CSceneDebugRoom::Change()
{
	// 全オブジェクトに死亡フラグを立てる
	CObjectManager::RefInstance().SetDeathAllObject();
}