//============================================================================
// 
// ゲームシーン、ヘッダファイル [scene.game.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.scene.h"
#include "obstacle_editer.h"

//****************************************************
// 前方宣言
//****************************************************
class CPlayer;

//****************************************************
// ゲームクラスの定義
//****************************************************
class CSceneGame final : public CScene
{
	//****************************************************
	// 静的定数の定義
	//****************************************************
	static const int MAX_PLYAER = 4; // 最大プレイヤー数

public:

	//****************************************************
	// special function
	//****************************************************
	CSceneGame();           // デフォルトコンストラクタ
	~CSceneGame() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	void Update() override; // 更新処理
	void Change() override; // シーン変更

private:

	//****************************************************
	// function
	//****************************************************
	void SpawnField();   // フィールドスポーン
	void SpawnPlayer();  // プレイヤースポーン
	void SpawnCPU();     // CPUスポーン
	bool CheckGameSet(); // ゲームセットチェック

	//****************************************************
	// data
	//****************************************************
	
	// プレイヤーの弱参照配列
	std::array<std::weak_ptr<CPlayer>, MAX_PLYAER> m_apwPlayers;

	// 障害物エディター
	ObstacleEditer m_ObstacleEditer;
};