//============================================================================
// 
// シーンマネージャー [scene.manager.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "scene.manager.h"
#include "scene.h"

//============================================================================
// 更新処理
//============================================================================
void CSceneManager::Update()
{
	// 遅延処理を保有していたら更新
	if (m_fpDelayBehavior)
	{
		// 遅延処理の完了状態を取得
		bool bEnd = m_fpDelayBehavior();
		
		// 処理が完了したらポインタを初期化
		if (bEnd)
		{
			m_fpDelayBehavior = nullptr;
		}

		useful::MIS::MyImGuiShortcut_BeginWindow("Any Debug");
		ImGui::Text("Transition Func Hold !!");
		ImGui::End();
	}

	// 現在のシーンの更新
	if (m_upScene)
	{
		m_upScene->Update();

		useful::MIS::MyImGuiShortcut_BeginWindow("Any Debug");
		ImGui::Text("Scene  : %s", typeid(*m_upScene).name());
		ImGui::End();
	}
}

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CSceneManager::CSceneManager()
	: m_upScene(nullptr)
	, m_fpDelayBehavior(nullptr)
{}

//============================================================================
// デストラクタ
//============================================================================
CSceneManager::~CSceneManager()
{
	// 終了処理
	Finalize();

	// 通過ログ
	OutputDebugStringW(L"dtor：シーンマネージャー\n");
}

//============================================================================
// 終了処理
//============================================================================
void CSceneManager::Finalize()
{}