//============================================================================
// 
// セレクトシーン、ヘッダファイル [select.scene.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.scene.h"

//****************************************************
// 前方宣言
//****************************************************
class CBeamLight;
class CHud;

//****************************************************
// セレクトシーンクラスの定義
//****************************************************
class CSceneSelect final : public CScene
{
	//****************************************************
	// エイリアスを定義
	//****************************************************
	using BeamLightQue = std::pair<float, DirectX::XMFLOAT2>;

public:

	//****************************************************
	// special function
	//****************************************************
	CSceneSelect();           // デフォルトコンストラクタ
	~CSceneSelect() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	void Update() override; // 更新処理
	void Change() override; // シーン変更

private:

	//****************************************************
	// function
	//****************************************************
	void WhileEvent_QueInstantiateLight(); // ビームライトの生成キュー
	void WhileEvent_CursorTrack();         // カーソルの追従

	//****************************************************
	// data
	//****************************************************

	/* 仮 */
	int                       m_nCommonCnt;    // 汎用カウンター
	std::vector<CBeamLight*>  m_vpBeamLight;   // ビームライト
	std::vector<BeamLightQue> m_vBeamLightQue; // ビームライトのためのキュー
	CHud*                     m_pCursor;       // カーソル
};