//============================================================================
// 
// タイトルシーン、ヘッダファイル [scene.title.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.scene.h"

//****************************************************
// 前方宣言
//****************************************************
class CHud;

//****************************************************
// タイトルクラスの定義
//****************************************************
class CSceneTitle final : public CScene
{
public:

	//****************************************************
	// special function
	//****************************************************
	CSceneTitle();           // デフォルトコンストラクタ
	~CSceneTitle() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************
	void Update() override; // 更新処理
	void Change() override; // シーン変更

	// ロゴ消去
	void TriggerEvent_DisappearLogo();

	// 緞帳移動
	void TriggerEvent_MoveSatinCurtain();

	// 幕を暗く
	void TriggerEvent_DarkFadeAllCurtain();

private:

	//****************************************************
	// function
	//****************************************************
	void WhileEvent_AnimationLogo(); // ロゴ動作

	//****************************************************
	// data
	//****************************************************

	/* 仮 */
	int                m_nCommonCnt;          // 汎用カウンター
	CHud*              m_pBackCurtain;        // 奥の幕
	std::vector<CHud*> m_vpSatinCurtain;      // 緞帳
	std::vector<CHud*> m_vpLogo;              // ロゴ
	bool               m_bAnimationStateLogo; // ロゴのアニメーション状態
	bool               m_bTransition;         // 遷移状態
};