//============================================================================
// 
// 影、ヘッダーファイル [shadow.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// 影クラスの定義
//****************************************************
class CShadow : public CRect3D
{
public:

	//****************************************************
	// special function
	//****************************************************
	CShadow(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CShadow() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 追従対象の物理モデルの設定
	void SetTrackTarget(const std::shared_ptr<CObject>& spTarget);

private:

	//****************************************************
	// data
	//****************************************************
	std::weak_ptr<CObject> m_wpTrackTarget; // 追従対象のオブジェクト
};