
// ※ このファイルは公開インターフェース用のヘッダーファイルです
// 　 利用者によるファイル内の実装変更を想定していないので直接行わないでください

//============================================================================
// 
// 影、ヘッダーファイル [shadow.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// 影クラスの定義
//****************************************************
class CShadow : public CRect3D
{
public:

	//****************************************************
	// special function
	//****************************************************
	CShadow(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CShadow() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;
};