//============================================================================
// 
// 衝撃波 [shockwave.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "shockwave.h"

// コライダーの作成用
#include "API.collision.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CShockWave::CShockWave(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CPhysicsObject(Type, Layer)
	, m_nDuration(0)
{}

//============================================================================
// デストラクタ
//============================================================================
CShockWave::~CShockWave()
{}

//============================================================================
// コライダーのファクトリ
//============================================================================
void CShockWave::FactoryCollider(Collision::SHAPETYPE Type, float fWidth, float fHeight, float fDepth)
{
	// ゴーストの作成
	SetCollider(CGhost::CreateGhost(GetTransform(), Type, fWidth, fHeight, fDepth));
}

//============================================================================
// 更新処理
//============================================================================
void CShockWave::Update()
{
	--m_nDuration;

	// 期間が無くなれば死亡フラグを立てる
	if (m_nDuration < 0)
	{
		SetDeath();
	}

	// WVP行列の更新
	CPhysicsObject::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CShockWave::Draw()
{
	// モデルの描画
	CPhysicsObject::Draw();
}