//============================================================================
// 
// シンボル、ヘッダーファイル [symbol.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// シンボルクラスの定義
//****************************************************
class CSymbol : public CRect3D
{
public:

	//****************************************************
	// special function
	//****************************************************
	CSymbol(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CSymbol() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// シンボルのインデックス
	void SetSymbolIdx(unsigned char wIdx);

	// シンボルの高さオフセット取得
	inline float GetSymbolOffsetY() const { return m_fSymbolOffsetY; }

private:

	//****************************************************
	// data
	//****************************************************
	float m_fSymbolOffsetY; // シンボルの高さオフセット
};