//============================================================================
// 
// 竜巻 [tornado.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "tornado.h"

// 物理挙動作成のため
#include "API.rigidbody.h"

// 衝撃波の作成のため
#include "bombshockwave.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CTornado::CTornado(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CObstacle(Type, Layer, OBS::OBSTACLE_TYPE::PERIMETER)
{}

//============================================================================
// デストラクタ
//============================================================================
CTornado::~CTornado()
{}

//============================================================================
// コライダーのファクトリ
//============================================================================
void CTornado::FactoryCollider(float fWidth, float fHeight, float fDepth)
{
	// デフォルトのリジッドボディの生成
	SetCollider(CRigidBody::CreateRigidBody(GetTransform(), Collision::SHAPETYPE::CYLINDER, fWidth, fHeight, fDepth));

	// コライダーをリジッドボディにキャスト
	const CRigidBody* const pRB = dynamic_cast<CRigidBody*>(GetCollider());

	// 質量を設定
	pRB->SetMass(1000.0f);
}

//============================================================================
// 更新処理
//============================================================================
void CTornado::Update()
{
	// 挙動
	Action();

	// 物理オブジェクト用の更新：WVP行列用定数バッファの更新
	CPhysicsObject::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CTornado::Draw()
{
	// 物理オブジェクト用の描画：モデルの描画
	CPhysicsObject::Draw();
}

//============================================================================
// パラメータの編集
//============================================================================
void CTornado::EditParam()
{}

//============================================================================
// 挙動
//============================================================================
void CTornado::Action()
{

}