//============================================================================
// 
// 竜巻 [tornado.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "tornado.h"

// 物理挙動作成のため
#include "API.world.h"
#include "API.rigidbody.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CTornado::CTornado(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CObstacle(Type, Layer, Obstacle::OBSTACLE_TYPE::PERIMETER)
	, m_StartPos(useful::VEC3_ZERO_INIT)
	, m_MoveDir(useful::VEC3_ZERO_INIT)
	, m_nTimer(0)
	, m_Width(0.0f)
	, m_Depth(0.0f)
{}

//============================================================================
// デストラクタ
//============================================================================
CTornado::~CTornado()
{}

//============================================================================
// コライダーのファクトリ
//============================================================================
void CTornado::FactoryCollider(float fWidth, float fHeight, float fDepth)
{
	// 竜巻用のリジッドボディの作成
	SetCollider(CRigidBody::CreateRigidBody(GetTransform(), Collision::SHAPETYPE::BOX, fWidth, fHeight, fDepth));

	// コライダーをリジッドボディにキャスト
	const CRigidBody* const pRB = dynamic_cast<CRigidBody*>(GetCollider());

	// Y軸以外の回転をロック
	pRB->SetAngularFactor({ 0.0f, 0.0f, 0.0f });
}

//============================================================================
// 更新処理
//============================================================================
void CTornado::Update()
{
	// 移動方向を設定
	SetMoveDir();

	// 挙動
	Action();

	// 物理オブジェクト用の更新：WVP行列用定数バッファの更新
	CPhysicsObject::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CTornado::Draw()
{
	// 物理オブジェクト用の描画：モデルの描画
	CPhysicsObject::Draw();
}

//============================================================================
// パラメータの編集
//============================================================================
void CTornado::EditParam()
{}

//============================================================================
// 挙動
//============================================================================
void CTornado::Action()
{
	// 進行方向をコピー
	btVector3 MoveDir = { m_MoveDir.x,m_MoveDir.y,m_MoveDir.z };

	// リジッドボディの取得
	const CRigidBody* const pRB = dynamic_cast<CRigidBody*>(GetCollider());

	// 現在の加速度をコピー
	const btVector3& rCurrentVel = pRB->GetLinearVelocity();

	// リジッドボディのアクティブ化
	pRB->SetActive();

	// 移動方向：Y軸：現在の重力速度を維持
	MoveDir.setY(rCurrentVel.getY());

	// 新しい加速度をセット
	pRB->SetLinearVelocity(MoveDir);
}

//============================================================================
// 移動方向を設定
//============================================================================
void CTornado::SetMoveDir()
{

	if (GetTransform().Pos.x <= m_StartPos.x + m_Width)
	{
		m_MoveDir = { 4.0f ,0.0f ,0.0f };
	}
	else
	{
		m_MoveDir = { 0.0f ,0.0f ,0.0f };
	}
}