//============================================================================
// 
// 竜巻、ヘッダーファイル [tornado.h]
// Author : 後藤優輝
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "obstacle.h"
#include "API.collider.h"

//****************************************************
// 竜巻クラスの定義
//****************************************************
class CTornado : public CObstacle
{
public:

	//****************************************************
	// special function
	//****************************************************
	CTornado(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CTornado() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// コライダーのファクトリ
	void FactoryCollider(float fWidth, float fHeight, float fDepth) override;

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// パラメータの編集
	void EditParam() override;

private:

	//****************************************************
	// function
	//****************************************************
	void Action(); // 挙動
};