//============================================================================
// 
// 警告、ヘッダーファイル [warning.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "API.rect.3D.h"

//****************************************************
// 前方宣言
//****************************************************
class CObstacle;

//****************************************************
// 警告クラスの定義
//****************************************************
class CWarning : public CRect3D
{
	//****************************************************
	// 静的メンバ定数の定義
	//****************************************************
	static constexpr float SPEED_ROTATE  = 0.01f; // 回転速度
	static constexpr float FACTOR_BRIFHT = 0.02f; // 明度変化量

public:

	//****************************************************
	// special function
	//****************************************************
	CWarning(OBJ::TYPE Type, OBJ::LAYER Layer); // デフォルトコンストラクタ
	~CWarning() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

	// 追従対象の物理モデルの設定
	void SetTrackTarget(const std::shared_ptr<CObstacle>& spTarget);

private:

	//****************************************************
	// function
	//****************************************************
	void UpdateBright(); // 明度の更新

	//****************************************************
	// data
	//****************************************************
	std::weak_ptr<CObstacle> m_wpTrackTarget; // 追従対象の障害物
	float                    m_fRotY;         // 回転量
	float                    m_fBright;       // 明度
	float                    m_fBrightFactor; // 明度変化量
};